##  Basic Filtering

In [1]:
import pandas as pd
import numpy as np
data = {
    'Name': ['Alice', np.nan, 'Charlie', 'David', 'Eva', 'Mayra',' Priyanka'],
    'Age': [25, 30, 35, 40, 22, 18, 19],
    'City': ['New York', 'London', 'Paris', 'New York', np.nan, 'Moscow', 'Berlin'],
    'Salary': [50000, np.nan, 55000, 70000, 65000, 72000, 80000]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4', 'row5', 'row6','row7'])
print(df)

           Name  Age      City   Salary
row1      Alice   25  New York  50000.0
row2        NaN   30    London      NaN
row3    Charlie   35     Paris  55000.0
row4      David   40  New York  70000.0
row5        Eva   22       NaN  65000.0
row6      Mayra   18    Moscow  72000.0
row7   Priyanka   19    Berlin  80000.0

In [2]:
# 31. Filter based on one condition: DataFrame ko filter karein jahan 'Age' 30 se zyada ho.
df[df['Age']>30]

         Name  Age      City   Salary
row3  Charlie   35     Paris  55000.0
row4    David   40  New York  70000.0

In [3]:
# 32. Filter based on a string value: DataFrame se un sabhi rows ko select karein jahan 'City' column ki value 'New York' ho.
df[df['City']=='New York']

       Name  Age      City   Salary
row1  Alice   25  New York  50000.0
row4  David   40  New York  70000.0

In [4]:
# 33. Filter based on multiple conditions (AND): Un rows ko filter karein jahan 'Age' 25 se zyada ho aur 'City' 'London' ho.
df[(df['Age']>25)&(df['City']=='London')]

     Name  Age    City  Salary
row2  NaN   30  London     NaN

In [5]:
# 34. Filter based on multiple conditions (OR): Un rows ko filter karein jahan 'Age' 30 se kam ho ya 'City' 'Paris' ho.
df[(df['Age']<30)|(df['City']=='Paris')]

           Name  Age      City   Salary
row1      Alice   25  New York  50000.0
row3    Charlie   35     Paris  55000.0
row5        Eva   22       NaN  65000.0
row6      Mayra   18    Moscow  72000.0
row7   Priyanka   19    Berlin  80000.0

In [6]:
# 35. Filter using isin(): Un sabhi rows ko select karein jinki 'City' 'Tokyo', 'Moscow', ya 'Berlin' mein se ek ho.
df[df['City'].isin(['Tokyo','Moscow','Berlin'])]

           Name  Age    City   Salary
row6      Mayra   18  Moscow  72000.0
row7   Priyanka   19  Berlin  80000.0

In [7]:
# 36. Filter out values: Un sabhi rows ko select karein jinki 'City' 'New York' na ho.
df[df['City']!='New York']

           Name  Age    City   Salary
row2        NaN   30  London      NaN
row3    Charlie   35   Paris  55000.0
row5        Eva   22     NaN  65000.0
row6      Mayra   18  Moscow  72000.0
row7   Priyanka   19  Berlin  80000.0

In [8]:
# 37. Filter for non-null values: Ek specific column se un sabhi rows ko select karein jahan value null na ho.
df[df['Name'].notnull()]

           Name  Age      City   Salary
row1      Alice   25  New York  50000.0
row3    Charlie   35     Paris  55000.0
row4      David   40  New York  70000.0
row5        Eva   22       NaN  65000.0
row6      Mayra   18    Moscow  72000.0
row7   Priyanka   19    Berlin  80000.0

In [14]:
# 38. Filter for null values: Ek specific column se un sabhi rows ko select karein jahan value null ho.
df[df['Salary'].isnull()]

     Name  Age    City  Salary
row2  NaN   30  London     NaN

In [12]:
# 39. Filter using string methods: 'Name' column mein 'A' se shuru hone wale sabhi naam waali rows ko filter karein.
df[df['Name'].str.startswith('A', na=False)]

       Name  Age      City   Salary
row1  Alice   25  New York  50000.0

In [ ]:
# 40. Filter using a query: query() method ka use karke 'Age > 22' condition ke saath rows ko filter karein.
df.query('Age > 22')

         Name  Age      City  Salary
row1    Alice   25  New York   50000
row2      Bob   30    London   60000
row3  Charlie   35     Paris   55000
row4    David   40  New York   70000